#+title: capnproto-rust's Hello World Example

This is the example from [[https://github.com/capnproto/capnproto-rust/tree/master/capnp-rpc/examples/hello-world][capnproto/capnproto-rust:capnp-rpc/examples/hello-world]]

To run, in two separate terminals, do:

#+begin_src fish :results raw
cargo run \
  --bin 'server' \
  -- \
  --address 'localhost:4030'
#+end_src

#+RESULTS:
Starting up server at 127.0.0.1:4030
response: Hello, World!

and

#+begin_src fish :results raw
cargo run \
  --bin 'client' \
  -- \
  --address 'localhost:4030' \
  --name "World"
#+end_src

#+RESULTS:
received: Hello, World!
